# Російські літери

RUSSIAN_LETTERS = {
    "ы",
    "э",
    "ё",
    "ъ"
}


# Пестливі закінчення

DIMINUTIVES = [
    "очка",
    "ечка",
    "онька",
    "енька",
    "уля",
    "юля",
    "ик",
    "чик",
    "очок",
    "усь",
    "чик"
]


# Заборонені слова

BAD_WORDS = {

    "хуй",
    "хуесос",
    "бля",
    "блядь",
    "єб",
    "еб",
    "пізд",
    "сука",
    "лох",
    "мудак",
    "долбоеб",

    "admin",
    "owner",
    "killer",
    "shadow",
    "dragon",

    "путін",
    "путин",
    "сталін",
    "ленін",
    "гітлер",
    "лукашенко",
    "пригожин",
    "мизулина",
    "кіркоров",
    "басков",
    "лепс",
    "бузова",

    "telegram",
    "discord",
    "steam",
    "youtube",
    "tiktok",
    "gta",

    "адмін",
    "администратор",
    "табуретка",
    "ракета",
    "акумулятор"
}


# Російські імена

RUSSIAN_NAMES = {

    "Петр",
    "Иван",
    "Федор",
    "Татьяна",
    "Миша",
    "Алексей",
    "Илья",
    "Сергей",
    "Дениска"

}
